llm/ministral_3/b200/bench/bench_sharegpt_high.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The tokenizer you are loading from 'mistralai/Ministral-3-14B-Instruct-2512' with an incorrect regex pattern: https://huggingface.co/mistralai/Mistral-Small-3.1-24B-Instruct-2503/discussions/84#69121093e8b480e709447d5e. This will lead to incorrect tokenization. You should set the `fix_mistral_regex=True` flag when loading this tokenizer to fix this issue.
[transformers] The tokenizer you are loading from 'mistralai/Ministral-3-14B-Instruct-2512' with an incorrect regex pattern: https://huggingface.co/mistralai/Mistral-Small-3.1-24B-Instruct-2503/discussions/84#69121093e8b480e709447d5e. This will lead to incorrect tokenization. You should set the `fix_mistral_regex=True` flag when loading this tokenizer to fix this issue.
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31001, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot-llm-interface/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='mistralai/Ministral-3-14B-Instruct-2512', served_model_name=None, tokenizer=None, num_prompts=80, sharegpt_output_len=8, sharegpt_context_len=8192, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=80, output_file='/data/bbuf/kda-pilot-llm-interface/llm/ministral_3/b200/bench/sharegpt_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31001, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot-llm-interface/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='mistralai/Ministral-3-14B-Instruct-2512', served_model_name=None, tokenizer=None, num_prompts=80, sharegpt_output_len=8, sharegpt_context_len=8192, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=80, output_file='/data/bbuf/kda-pilot-llm-interface/llm/ministral_3/b200/bench/sharegpt_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 27044
#Output tokens: 640
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 80        
Successful requests:                     80        
Benchmark duration (s):                  9.39      
Total input tokens:                      27044     
Total input text tokens:                 27044     
Total generated tokens:                  640       
Total generated tokens (retokenized):    622       
Request throughput (req/s):              8.52      
Input token throughput (tok/s):          2880.25   
Output token throughput (tok/s):         68.16     
Peak output token throughput (tok/s):    80.00     
Peak concurrent requests:                80        
Total token throughput (tok/s):          2948.41   
Concurrency:                             79.87     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   9373.93   
Median E2E Latency (ms):                 9373.91   
P90 E2E Latency (ms):                    9374.71   
P99 E2E Latency (ms):                    9375.51   
---------------Time to First Token----------------
Mean TTFT (ms):                          2605.50   
Median TTFT (ms):                        2394.48   
P99 TTFT (ms):                           3393.13   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          966.92    
Median TPOT (ms):                        997.01    
P99 TPOT (ms):                           1027.61   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           999.03    
Median ITL (ms):                         996.03    
P95 ITL (ms):                            1007.49   
P99 ITL (ms):                            1007.51   
Max ITL (ms):                            2005.82   
==================================================